[
  {
    "title": "IntegrationQt/C++ Android App with Google Play Subscriptions",
    "content": "We have a functioningQt/C++ app running on Android but not yet published.  We wish to add support for subscriptions to the app, mirroring the subscriptions we provide for the same app on IOS.  We are experienced developers and can handle all aspects ofQtuser interface.\n\nWe require a C++ module/library for interfacing with Google Play subscriptions and a sample app that demonstrates the functionality.  The module will interface with Java API's for purchasing, cancelling, querying status of user subscriptions.  The API will be general purpose in nature, although it may not need to handle aspects of Google Play subscriptions not required by our app.  The module will be 100% independent of our software.  We will likely choose to release the module as open-source.\n\nWe will use the C++ API to interface our app with Google Play store.  We will require guidance and help in packaging C++/Java code you write into our APK and related resources so the combined software can be successfully submitted to the Google play store for publication.\n\nThe successful developer will:\n* Be familiar Google Play subscriptions\n* Knowledgeable about interfacing C++/Qt/Java software\n* Able to write robust, clean, readable, documented C++/Java code.\n* Able to design a suitable general purpose C++ subscription API\n* Familiar with packaging of Android apps for submission to the store\n* Knowledgable about Google Play sand-boxing for validating our app.\n* Communicate in English with experienced developers and assist with integration process.\n\nRequirements\n* Support a handful of monthly and annual subscriptions options.\n* Allow discovery of subscription naming & pricing, allowing changes on the Play store to be reflected in our app.\n* Make use of Google Play sandboxing so that the subscriptions may be validated prior to publication\n\nThe steps we plan to follow:\n* Review our existing IOS app and subscriptions\n* Propose a suitable C++ API.\n* We will review and approve this API\n* Implement C++ module and example app.\n* We will validate this app and review the software.\n* Assist with any questions during our integration\n* Assist with any submission of our app to Google Play store",
    "link": "https://www.upwork.com/jobs/Integration-span-class-highlight-span-Android-App-with-Google-Play-Subscriptions_~021924088211729841666/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Debug and fix a C++ program withQtand LibTorch",
    "content": "I have a tiny inference program on Python with PyTorch as an attachment. It can run well with a given model and some input images. I have converted the code into C++ to run with LibTorch andQt(using QImage). The new program is very small too, and can run fine with some input images. However, for some other input images, it may create some wrong/different outputs, compared with those running from the Python program. I have tested mainly on macOS.\n\nYour job is to debug, find and fix theQtC++ program thus it can create a similar result (for given images, just a few 2-3 images) with the original one in Python.\n\nIt is a good idea if you can show me some evidence that you are good atQtand LibTorch.\n\nNote: You are supposed to be a master of LibTorch andQt. Don’t ask me how to install or compile them. I have worked on my project for a while, tried some solutions, but not helped. That means it is not a very simple job at first glance - that is why I need help from good ones. I am not a newbie, and I don’t need work from a newbie.",
    "link": "https://www.upwork.com/jobs/Debug-and-fix-program-with-span-class-highlight-span-and-LibTorch_~021923938726222706228/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "QTGUI Opengl User Interface Designer needed",
    "content": "HeyQTprogrammers \nWe need some UI work done in our software. \nIts C++ and we are usingQT6.8.0 \n\nI need someone very experienced \nbecause the UI i need you to work on is our animation timeline\nand then make a new UI for face animation(face controller)\ni have examples and will show you",
    "link": "https://www.upwork.com/jobs/span-class-highlight-span-GUI-Opengl-User-Interface-Designer-needed_~021923783610774355458/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "SeniorQtapplication/Dicom software engineer",
    "content": "We need senior software engineers with master degrees, experience with largeQtapplication development and extensive knowledge of Dicom and clinical tools",
    "link": "https://www.upwork.com/jobs/Senior-span-class-highlight-span-application-Dicom-software-engineer_~021923630428919310829/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "UI Developer Required for Touchscreen Interface on Embedded Linux Device",
    "content": "Description\nWe are looking for a freelancer to help us design and implement the foundational UI for a touchscreen-based embedded system. This is a technical interface for a lab-grade device, and the UI should be clean, responsive, and extendable.\n\nScope of Work\n-Create a basic UI layout with placeholder sections (e.g., control panel, plots, logs)\n-Add a splash screen that displays on boot\n-Ensure the UI auto-launches on system startup\n-Confirm USB touchscreen input works correctly\n-Use a scalable framework (Qt/QML, Python + Kivy, PyQt, or similar)\n\nRequirements\n-Experience building UIs on embedded Linux platforms\n-Familiarity with touchscreen interaction and layout design\n-Proficiency inQt/QML, PyQt, or similar frameworks\n-Ability to configure autostart and handle display + input devices\n-Clean, modular code and strong communication\n\nNice to Have\n-Experience with plotting or waveform display\n-Familiarity with serial/I/O communication (SPI/UART/USB) for future integration\n\nDeliverables\n-Source code of the UI (with comments)\n-Instructions for deployment\n-Optional: setup script or Docker container",
    "link": "https://www.upwork.com/jobs/Developer-Required-for-Touchscreen-Interface-Embedded-Linux-Device_~021923601162290804276/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "QTmobil photoshooting  application",
    "content": "I need a mobile application developed usingQTfor both Android and iOS platforms. The app is a multi-platform photo shooting application.\n\nKey features should include:\n- User authentication\n\n- Push notifications\n\nIdeal Skills and Experience:\n- Proficiency inQTand mobile app development for Android and iOS\n- Experience with user authentication and in-app purchase integration\n- Knowledge of implementing push notifications\n- Strong background in UI/UX design for mobile applications",
    "link": "https://www.upwork.com/jobs/span-class-highlight-span-mobil-photoshooting-application_~021923297254397827716/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "UI Developer for Audio-Visual Touchscreen Device (Linux + Flutter orQt)",
    "content": "Project Overview:\n\nWe’re building a screen-based audio-visual player designed for young children. The hardware prototype is complete and fully functional — powered by a Raspberry Pi CM4 running Linux.\n\nWe now need a UI-focused developer to implement the front-end experience. All backend and hardware logic (e.g., sensors, buttons, WiFi scanning, power control) is already handled in a lightweight service. Your role is to create a delightful, polished touchscreen interface that’s intuitive, fast, and ready to grow into a larger product ecosystem.\n\nWhat This Job Is (and Isn’t):\n\n✅ YES — It's mostly front-end UI work\nYou’ll build a touch-optimized media interface using Flutter orQtYou’ll read from simple text files on the system to get state updates (e.g., button press, WiFi info)\nYou'll control local audio/video playback, UI transitions, and power states\nThe UI will eventually support a content library and subscription model\n\n❌ NO — You don’t need to build or touch the firmware\nNo low-level hardware programming\nNo GPIO, driver, or kernel work\nNo device prototyping or electrical work\n\nResponsibilities:\n\n🎨 UI Development (Main Focus)\nBuild a responsive UI (Flutter orQt) for use on a 5.5–6” touchscreen\nDisplay a grid of media thumbnails (think: children’s stories)\nImplement tap/play interactions, visual feedback, transitions, and idle behavior\nEnable basic functions: sleep, play/pause, resume, exit\n\n🧩 Light Backend Integration\nRead prewritten files from the local file system to update UI (e.g., list of stories, battery state)\nPass simple playback commands by writing to system-monitored files\nNo networking or sockets required\n\nTech Stack:\nOS: Linux (ARM64), Raspberry Pi CM4\nUI: Flutter (preferred) orQtLanguage: Dart or C++/Python\nMedia: MP3/MP4 (local playback only at this stage)\nIntegration: File-based IPC\n\nIdeal Candidate:\nExperience with embedded or device UI development\nAbility to turn static designs into simple, polished, responsive experiences\nKnowledge of Linux file handling (open, read, write)\nUnderstands performance trade-offs on lower-resource hardware (RAM, battery)\nClear communicator and able to work independently\n\nNice-to-Haves:\nAudio/video playback experience on Linux\nExperience designing interfaces for children or accessibility\nFamiliarity with Raspberry Pi or similar single-board computers\n\nWhat We Provide:\nFully working hardware prototype\nBackend systems running (sensor logic, power, WiFi, etc.)\nUI design files (Figma or static assets)\nClear requirements and milestones\nWeekly calls with the project owner\n\nTo apply please include:\nA short note about your interest and availability\nExamples of past UI work on hardware, embedded, or media products\nAnything you’ve built with Flutter,Qt, or for Linux-based systems",
    "link": "https://www.upwork.com/jobs/Developer-for-Audio-Visual-Touchscreen-Device-Linux-Flutter-span-class-highlight-span_~021922680070130607239/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "C++ VLC Media Player Developer (Qt6 - Custom Desktop Player, Netflix-like UI)",
    "content": "Description:\n\nWe are seeking an experienced C++ developer to build a custom desktop media player application using libVLC (VLC SDK) with aQt6-based modern user interface.\n\nThe player will act as a dedicated client for a pre-existing API backend, fetching stream information and handling media playback via VLC engine integration, while providing a custom, Netflix-style desktop user experience.\n\nThis is not a generic player, but a specific purpose streaming client with a custom UI and essential player controls.\nCore Requirements:\n\n    C++ (modern C++17 or newer)Qt6 (Widgets or QML) UI framework experience\n\n    libVLC (VLC SDK) integration\n\n    Implementation of core player features:\n\n        Play / Pause\n\n        Seek / Progress bar\n\n        Volume control\n\n        Fullscreen toggle\n\n        Subtitle selection\n\n        Audio track switching\n\n        Video quality handling (HLS, DASH support via VLC)\n\n        Keyboard shortcuts\n\n    API interaction (REST API or JSON-based endpoints provided)\n\n        Fetch media details (URL, metadata, subtitles, etc.)\n\n        Authenticate session, manage tokens\n\nBonus Skills (nice to have):\n\n    Familiarity with Netflix-style UI design patterns\n\n    Custom controls and skins development inQtExperience with performance optimization in streaming applications\n\n    Cross-platform deployment experience (Windows & macOS)\n\n    Packaging the application as .exe and .app including VLC runtime\n\nDeliverables:\n\n    Full cross-platform C++ source code with CMake project setup\n\n    Functional desktop builds for Windows & macOS\n\n    Complete working UI with all controls fully implemented and tested\n\n    Deployment documentation (build, install, configure)\n\n    Integration with provided API (authentication, stream fetching, etc.)\n\nImportant Notes:\n\n    No usage of C#, .NET, or Electron — pure C++ /Qt6 only.\n\n    This is a desktop-only application, no mobile development involved.",
    "link": "https://www.upwork.com/jobs/VLC-Media-Player-Developer-span-class-highlight-span-Custom-Desktop-Player-Netflix-like_~021922378526458723102/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Help me polish my python desktop app. Looking for a partner willing to work long term for equity.",
    "content": "Hi! I’m looking for a skilled Python developer with experience working with the dxcam (DirectX camera) library to help solve a specific crash issue in my desktop app, help polish my app to make it releasable quality, and potentially work long term with me as a partner for project equity.\n\nContext:\nI built a desktop app called LobbyBot, which lets users customize and play their own music while waiting in lobbies for games like Valorant and Fortnite. It accesses the game’s timing and screen states using the dxcam library for pixel capture.\n\nHowever, there’s a problem: when alt-tabbing out of Valorant, the game changes screen resolution or display mode (as Valorant often does), and that breaks dxcam, which causes a chain reaction of errors and crashes the entire app. Since users often alt-tab to control their music or multitask, this needs to be fixed for the app to be reliable.\n\nWhat I need:\nI need someone who can investigate this issue and come up with a viable solution or reliable workaround. Whether it’s handling the alt-tab event more gracefully or adjusting how dxcam is initialized or used, I need the app to stop crashing during normal use. Also someone who can dedicate time to help me polish the app and make it releasable quality. It would also be a bonus if the candidate knows a bit about Overwolf and it's API.\n\nIdeal skills:\n- Strong Python knowledge\n- Experience with desktop apps (e.g., PyQt5, Tkinter, or other GUI frameworks)\n- Familiarity with the dxcam library or DirectX-based screen capture\n- Debugging experience with Windows-specific behaviors\n\nHow I like to work:\n- Clear communication through Upwork messages or chat\n- I’ll provide the current code and any logs or crash reports\n- I’m open to suggestions on better practices or alternative approaches\n- Prefer fast turnaround, but clean and stable code is most important\n\nIf you’ve worked on similar bugs or have experience debugging system-level interactions in Python, I’d love to hear how you’d approach this.\n\nThanks!",
    "link": "https://www.upwork.com/jobs/Help-polish-python-desktop-app-Looking-for-partner-willing-work-long-term-for-equity_~021921317135799213452/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "OpenGL 4 Graphics Programmer Needed",
    "content": "Hello I need a very professional Graphics Programmer who understands real time applications and how to optimize softwares for high performance, to help me add some hardcoded functionality  to the UI. We useQT. \n\nBasically this takes is mostly connecting certain things to the UI for finer control. \n\nAnd some light refactoring if needed and debugging. \nSo I need someone very good at low level programming and high performance optimizations for  best real time performance",
    "link": "https://www.upwork.com/jobs/OpenGL-Graphics-Programmer-Needed_~021906682169117798174/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Metrology Software Using Opencascade andQt",
    "content": "Hi there,\n\nI am trying to code aqtc++ desktop application for an probed optical cmm measurement device. I use the open cascade library for 3d kernel. Right now, I am using Fougue's Mayo git repository as base code but I think I won't be able to make a clean code.\n\nThe application will have this features:\n- real time sampling (I can do that part) and visualising the probe on real-time\n- creating basic geometries like plane, line circle etc. feature\n- import cad data(step, iges) with GD&T feature\n- visualize the geometries, shapes, gd&t features, \n- reporting the measurement feature\n\nSome features are already done thanks to Mayo Application. \n\nthe project can be divided to 3 milestones.\n1st milestone is creating basic geometries, visualising the geometries and the probe on real-time, measuring distance or angle btw geometries, manuel tolerancing and reporting\n \n2nd milestone is cad import-export, selecting basic geometries from the cad, calculating distance or angle, showing as bubble format,  reporting \n\n3rd difficult part :) GD&T integration\n\nI can send the current source code. I have made some modifications on to the repository. I added a layer manager system which controls shape's color, transparency and visibility.",
    "link": "https://www.upwork.com/jobs/Metrology-Software-Using-Opencascade-and-span-class-highlight-span_~021921681766417882508/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Fix Alt-Tab Crash in Python Desktop App (Must Know dxcam / DirectX Camera Library)",
    "content": "Hi! I’m looking for a skilled Python developer with experience working with the dxcam (DirectX camera) library to help solve a specific crash issue in my desktop app.\n\nContext:\nI built a desktop app called LobbyBot, which lets users customize and play their own music while waiting in lobbies for games like Valorant and Fortnite. It accesses the game’s timing and screen states using the dxcam library for pixel capture.\n\nHowever, there’s a problem: when alt-tabbing out of Valorant, the game changes screen resolution or display mode (as Valorant often does), and that breaks dxcam, which causes a chain reaction of errors and crashes the entire app. Since users often alt-tab to control their music or multitask, this needs to be fixed for the app to be reliable.\n\nWhat I need:\nI need someone who can investigate this issue and come up with a viable solution or reliable workaround. Whether it’s handling the alt-tab event more gracefully or adjusting how dxcam is initialized or used, I need the app to stop crashing during normal use.\n\nIdeal skills:\n- Strong Python knowledge\n- Experience with desktop apps (e.g., PyQt5, Tkinter, or other GUI frameworks)\n- Familiarity with the dxcam library or DirectX-based screen capture\n- Debugging experience with Windows-specific behaviors\n\nHow I like to work:\n- Clear communication through Upwork messages or chat\n- I’ll provide the current code and any logs or crash reports\n- I’m open to suggestions on better practices or alternative approaches\n- Prefer fast turnaround, but clean and stable code is most important\n\nIf you’ve worked on similar bugs or have experience debugging system-level interactions in Python, I’d love to hear how you’d approach this.\n\nThanks!",
    "link": "https://www.upwork.com/jobs/Fix-Alt-Tab-Crash-Python-Desktop-App-Must-Know-dxcam-DirectX-Camera-Library_~021921317135799213452/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Python Developer Needed for OpenBoard Tool Customization",
    "content": "We are seeking a skilled Python developer with experience in theQTframework to assist in copying or editing the OpenBoard tools, which are open-source. The ideal candidate should be proficient in Python programming, have a solid understanding of theQTframework, and be familiar with open-source projects. If you have the required skills and are passionate about contributing to educational tools, please reach out for more details. We look forward to collaborating on this exciting project!",
    "link": "https://www.upwork.com/jobs/Python-Developer-Needed-for-OpenBoard-Tool-Customization_~021920825642342096922/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "PythonQtSpecialist for Desktop Application Packaging",
    "content": "We are seeking a skilled PythonQtSpecialist to assist with the packaging, delivery, and update processes of our desktop application. The ideal candidate will have a strong background in Python andQt, with experience in creating user-friendly installation packages and managing application updates. Your expertise will help streamline our deployment process and enhance the user experience. If you are passionate about desktop application development and have a keen eye for detail, we would love to hear from you.\n\nI've been buildingQtdesktop applications for clients. I need a quality way to build in the ability to push updates, migrate to an updated database design, and implement other features and functions as required.",
    "link": "https://www.upwork.com/jobs/Python-span-class-highlight-span-Specialist-for-Desktop-Application-Packaging_~021920601142747486583/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Make New GUI",
    "content": "Hello!\nI have a C++ application with a basic UI. I have a new design created in Adobe XD. I need someone to:\n\n1. Recreate the new UI based on the Adobe XD design\n2. Integrate the new UI with my existing C++ codebase\n\nI will provide the design file, assets, and source code. Let me know if you need are interested. Thanks!",
    "link": "https://www.upwork.com/jobs/Make-New-GUI_~021920552748476404511/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Drone Basestation Stack Forked from QGroundControl",
    "content": "# 📡 Zion Basestation Software – Specification Document\n\n## 🧭 Overview\n\nZion is a ground-control application forked from QGroundControl, designed for in‑field, offline-first operations. It empowers users to:\n\n* Build and visualize global LiDAR maps\n* Provision drones via Ansible\n* Manage firmware and token-based access with cloud synchronization\n* Plan and dispatch complex multi‑drone missions using a custom YAML schema\n\n## 🧱 Architecture\n\n* **Core**: C++/Qt(QGroundControl base)\n* **Extensions**: Rust/Python (SLAM, token logic, Ansible orchestration)\n* **UI**: QML/QtQuick (new pages under `Setup` & `Plan` views)\n* **Build**: CMake +QtCreator\n* **Networking**: Local WiFi (drone ↔ Zion), REST (Zion ↔ Cloud)\n* **Storage**:\n\n  * **SQLite** for tokens & sessions\n  * **YAML** for mission plans\n  * **Filesystem** for map data & firmware archives\n\n---\n\n## 🗺️ 1. LiDAR Map Builder\n\n### 🎯 Purpose\n\nAggregate raw point clouds from Scout drones into a single, interactive 3D map for mission planning.\n\n### ⚙️ Functionality\n\n* **Input**: Raw point cloud files (format TBD by SW engineer)\n* **Processing**: Invoke external SLAM backend e.g. Fast‑LIO2, Cartographer\n* **UI**: `ZionMapView.qml` renders map over satellite imagery or grid\n* **Output**: Map artifacts such as voxel grids, mesh, metadata stored for reuse\n\n### 📌 Notes\n\n* Drone‑side SLAM remains for collision avoidance only\n* Global map generation exclusively on Zion\n\n---\n\n## ⚙️ 2. Ansible Deployment System\n\n### 🎯 Purpose\n\nAutomate provisioning of Jetson compute modules and Mini Pix flight controllers.\n\n### ⚙️ Functionality\n\n* **Dynamic Templates**: Jinja2‑based playbooks per drone model\n* **Targets**:\n\n  * Jetson: OS packages, Rust runtimes, service daemons\n  * FC: Firmware flashing via DFU over USB\n* **UI**: `ZionDeployPage.qml` under `Setup` tab for inventory & status\n* **Offline**: All assets such as playbooks and firmware cached locally\n\n---\n\n## ☁️ 3. Cloud Communication & OTA Updates\n\n### 🎯 Purpose\n\nKeep token balances, session logs, and firmware versions in sync with the cloud.\n\n### ⚙️ Functionality\n\n* **REST API** endpoints:\n\n  * POST /api/v1/sync\\_tokens\n  * GET /api/v1/balance?user\\_id=id\n  * GET /api/v1/firmware/latest\n* **Download & Cache** firmware packages locally\n* **Upload** session logs and telemetry when online\n* **Network Resilience**: Retry & backoff on failures\n\n---\n\n## 🔐 4. Token Access Control\n\n### 🎯 Purpose\n\nEnforce pay‑per‑use access: **1 Token = 1 Drone = 24 Hours**\n\n### ⚙️ Storage (SQLite)\n\n```sql\nCREATE TABLE tokens (\n  user_id TEXT PRIMARY KEY,\n  balance INTEGER,\n  last_sync TIMESTAMP\n);\n\nCREATE TABLE sessions (\n  session_id TEXT PRIMARY KEY,\n  user_id TEXT,\n  drone_id TEXT,\n  start_time TIMESTAMP,\n  end_time TIMESTAMP,\n  synced BOOLEAN DEFAULT 0\n);\n```\n\n### 🔄 Sync Logic\n\n* **Offline**: Check local balance before mission start\n* **Online**: Push new sessions; pull updated balances\n* **UI**: Display balance & active sessions on mission screen\n\n---\n\n## 🧭 5. Mission Planning & Dispatch\n\n### 🎯 Purpose\n\nDefine, preview, and send custom missions to one or more drones.\n\n### 📋 YAML Schema\n\n```yaml\nmission_id: field_spray_001\ndrones:\n  - id: DRONE_A\n    waypoints:\n      - position: [12.345, 67.890, 10.0]\n        yaw: 180.0\n        actions:\n          - StartSprayer: flow_rate: 0.3\n          - Hold: seconds: 10\n      - position: [12.346, 67.891, 10.0]\n        yaw: 90.0\n        actions:\n          - TakePhoto: resolution: \"4k\"\n          - DescendTo: altitude: 3.0\n```\n\n### ⚙️ Functionality\n\n* **UI**: `ZionPlanView.qml` overlays map; drag‑drop waypoints\n* **Drone Discovery**: Static IP, mDNS, or manual entry\n* **Dispatch**: POST http\\://drone\\_ip/mission\n* **Actions**: StartSprayer, Hold, TakePhoto, DescendTo, Land, WaitForSignal\n\n---\n\n## ✅ Next Steps\n\n1. Define raw LiDAR buffer spec\n2. Select & integrate global SLAM backend\n3. Create Ansible playbook templates\n4. Scaffold SQLite token DB & sync client\n5. Draft REST API specification\n6. Build QML components for map, deploy, tokens, mission UI\n\n---\n\n## 📎 Appendix\n\n* **Drone Classes**: Scout (LiDAR), Worker (Sprayer), Hauler (Heavy Lift)\n* **Local HTTP Server**: All drones host a REST endpoint for mission reception\n* **Offline‑First**: Zion operates without connectivity; syncs when available",
    "link": "https://www.upwork.com/jobs/Drone-Basestation-Stack-Forked-from-QGroundControl_~021920013693372713222/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "C++/QTDeveloper with Object detection AI/ML model integration",
    "content": "We have our C++/QTapp with camera feed integration, we are going to implement Object detection model using OpenCV/PyTorch and Python programming.\nPlease apply to this job if you can help us in this project.",
    "link": "https://www.upwork.com/jobs/span-class-highlight-span-Developer-with-Object-detection-model-integration_~021919700779519683125/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Development of a OpenCV Application for image based  Weld and Hole Inspection (Python, PyQt5)",
    "content": "Please offer a fixed price milestones:\n\nWe are looking for an experienced software developer to build a structured and well-documented Python-based desktop application for image-based inspection of industrial parts.\n\nThe software will capture images from two USB camera (in future maybe more), detect and measure weld seams and elongated/circular holes, and document the results.\nThere are two sides of the Part that has to be checked. We think two detailed pictures are better than a total picture with bothsides. Every Check has to be 2 pictures that are OK.\n\nCore Features:\n- Camera calibration using a checkerboard or marker pattern (settings saved in config file)\n- Live display of the USB camera feed\n- Manual and automatic image capture\n- Detection of part presence\n- Detection and measurement of weld seams\n- Detection and measurement of round and elongated holes\n- Display of original and processed images side-by-side\n- Overlay creation (measurement labels, highlighted features)\n- Red/Green status indicator (part OK / not OK)\n- Saving of images and results (CSV)\n\nAdditional Features:\n- Configurable measurement thresholds (via config file)\n- Input of job number, part counter, correction for rejected parts\n- Triggering of image capture manually or automatically (e.g. when part is still-optional)\n- Modular and maintainable source code with documentation\n\nFuture Addition:\nFor Future (next projekt) there are also 2 other faces with weldments that maybe should be intecrated.\n\nSuggested Technology:\n- Python 3.10+\n- OpenCV 4.x\n- PyQt5 (or PyQt6 as alternative)\n- CSV export (Pandas optional)\n- Modular structure, PEP8-compliant code\n\nProposed Project Structure:\n/HousingCheckingApp/\n├── main.py\n├── config.py\n├── camera/\n│   └── camera_controller.py\n├── image_processing/\n│   ├── detection.py\n│   ├── calibration.py\n├── ui/\n│   └── main_window.py\n├── utils/\n│   ├── file_utils.py\n│   └── logger.py\n├── resources/\n└── README.md\n\nGUI Layout (Concept):\nSee attached\n\nProposed Milestones:\nPhase 1: prove of concept (one Side - quick and dirty - input file - output: filterd image, image with markups)\nPhase 2: Setup, camera connection, base GUI\nPhase 3: Image processing, detection, overlay\nPhase 4: Image saving & CSV export\nPhase 5: Calibration\nPhase 6: Configurable thresholds, job tracking counters\nPhase 7: Optimization, testing, documentation\n\n\nAttachments:\nWe will provide:\n- Sample test images (good and bad parts)- Attached in Low quaity.\n- A basic GUI mockup\n- Process description\n\n\nFreelancer Requirements:\n- Experience in OpenCV-based vision systems is mandatory\n- Please include examples of **similar projects**, preferably with screenshots or videos\n- Please outline your proposed technical approach briefly (tools, structure, design ideas) not just a standard applikation text. It has to fit our requirements.\n- The final delivery must include all source code and usage documentation\n\nPlease offer a fixed price milestones.\n\nFollow-up collaboration possible for future extensions or maintenance.",
    "link": "https://www.upwork.com/jobs/Development-OpenCV-Application-for-image-based-Weld-and-Hole-Inspection-Python-span-class-highlight-span_~021919704719779318721/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Python Desktop App Developer – Build GUI Around AI Model (PDF Symbol Detection)",
    "content": "Here’s what I need:\nI have a trained AI model that detects electrical symbols in construction drawings (PDF format). The model is already working and detects most symbols with around 75–90% accuracy. It also needs to give a quantity per symbol for example D1 Light Fitting – 283 \n________________________________________\nGoal (Phase 1 – Desktop App):\nI want to turn this into a Windows desktop application that I can use on my local PC. I have a GeForce RTX 4070 GPU, so the app should use CUDA acceleration for fast detection.\nThis version is for internal use only so I can:\n•\tTest the AI model on real drawings\n•\tManually correct AI mistakes (missed or mislabeled symbols)\n•\tStress test the full workflow\n•\tLog every correction made, so the model can be retrained later with better data on a continuous basis. (If you have any ideas in regards to making the model more accurate or logging of changes ill be making manually, please let me know)\n________________________________________\nWhat the app should do:\n1.\tLet me drag and drop PDF drawings into the program\n2.\tAutomatically run the AI model on the drawing\n3.\tShow me the PDF with bounding boxes over detected symbols in different colours for each symbol.\n4.\tAllow me to:\no\tDelete wrong detections\no\tAdd missing symbols manually\no\tChange labels of symbols that were mislabeled\no\tWhen doing all of the above it automatically changes the quantitys of each symbol.\n5.\tShow a live count of each symbol type\n6.\tExport:\no\tA marked-up PDF\no\tA CSV or Excel file with total counts for each fitting and a small picture of the symbol.\n7.\tMOST IMPORTANT:\nEvery time I make a correction, I want the app to automatically save a log (e.g. corrections.csv or .json) that includes:\no\tDrawing name\no\tPage number\no\tSymbol type\no\tCoordinates (x, y, width, height)\no\tThe correction type (added / deleted / relabeled)\nThis file will be used by my AI developer to retrain and fine-tune the model based on my edits, or if you can do the following im happy to use you. Please let  me know if you can or cant.\n________________________________________\nPhase 2 – Cloud SaaS Platform (After Testing):\nOnce this desktop version is working well and the model is accurate, I plan to turn it into a cloud-based web platform that customers can use. If this goes well, I'd like to work with you long-term on that too. Although if you can only do phase 1 please let me know as I’m happy with that also.\n________________________________________\nTech Requirements:\n•\tMust run locally on Windows (standalone .exe)\n•\tMust use CUDA (GPU support) for fast AI inference (RTX 4070)\n•\tGUI can be in PyQt5, PySide2, or Tkinter\n•\tUse fitz (PyMuPDF) or similar to render PDFs with overlays\n•\tPackaged cleanly using PyInstaller or similar\n•\tThis desktop program you will be creating does not have to look sleek or clean it needs to just do what I explained above as this is just a program so I can stress test the model with multiple drawings and then make the model as accurate as possible.\n________________________________________\nNext Steps:\nPlease send:\n•\tExamples of similar tools you've built (desktop apps, AI interfaces, etc.)\n•\tYour estimated timeline and fixed price (preferred)\n\nThanks,",
    "link": "https://www.upwork.com/jobs/Python-Desktop-App-Developer-Build-GUI-Around-Model-PDF-Symbol-Detection_~021919633307249852508/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "C++ /QtSpecialist for Multi-Camera Video & Dante Audio Capture/Recording/Display (MVP)",
    "content": "We seek a highly skilled and experienced C++ andQtdeveloper to build a Minimum Viable Product (MVP) for a media center application. This project involves developing a robust system for capturing, processing, recording, and displaying high-quality video and audio streams.\n\nThe core functionalities required for this MVP include:\n\nMulti-Camera Video Capture: Implementing capture from multiple video sources via a Blackmagic Decklink 8K Pro capture card.\nMulti-Channel Audio Capture: Integrating audio capture from multiple channels using a Dante Virtual Soundcard.\nConfigurable Video Recording: Developing a system to record the captured video streams to multiple hard drives based on predefined configurations (e.g., recording day).\nReal-time Video Display: Displaying the captured video feeds on a screen using a visually appealing and responsive user interface built withQtand QML.\nThis project presents interesting challenges in real-time multimedia processing, hardware interaction, and performance optimization.\n\nWe are looking for a professional with the following qualifications:\n\nExtensive C++ Experience: 5+ years of professional experience in C++ development.\nStrongQtProficiency: Significant experience with theQtframework, including building modern and intuitive user interfaces withQtQuick (QML).\nMultimedia Processing Expertise: Proven experience in solving problems related to audio and video processing, including capture, manipulation, and synchronization.\nPerformance Optimization: Experience optimizing software performance, including multi-core CPU utilization and leveraging GPU processing capabilities where applicable.\nHardware Interaction (Desirable): Experience working with hardware like capture cards (experience with Blackmagic products is a plus) and audio interfaces (understanding of Dante or similar audio-over-IP technologies is beneficial).\nProblem-Solving Skills: Ability to tackle complex technical challenges in a multimedia processing pipeline.\nMVP Mindset: Ability to focus on core requirements and deliver a functional MVP efficiently.\nIf you are a C++ andQtexpert with a passion for multimedia development and optimization, and you're looking for an interesting and challenging project, we encourage you to apply.\n\nTo be considered, please include in your proposal:\n\nYour relevant experience with C++ andQt, specifically highlighting multimedia projects.\nExamples of your work withQtQML for creating user interfaces.\nYour experience with performance optimization techniques (CPU and GPU).\nAny experience you have with video/audio capture hardware or technologies like Blackmagic or Dante.\nYour proposed approach to tackling the key challenges of this project.\nWe look forward to reviewing your proposals.\n\nProject Type: Fixed-Price or Hourly (To be discussed based on proposal)\n\nDuration: (Estimate based on MVP scope - can be discussed)\n\nSkills Required: C++,Qt,QtQML, Video Processing, Audio Processing, Multithreading, Performance Optimization, GPU Acceleration, Blackmagic Decklink, Dante, FFmpeg (potentially, depending on approach)",
    "link": "https://www.upwork.com/jobs/span-class-highlight-span-Specialist-for-Multi-Camera-Video-amp-Dante-Audio-Capture-Recording-Display-MVP_~021919370649613389375/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Editawebinar funnel on GoHighLevel",
    "content": "I ownasmall business and I would like to editawebinar funnel on GoHighLevel..\n\nYou will also connect my Stripe account for payment...",
    "link": "https://www.upwork.com/jobs/Edit-span-class-highlight-span-webinar-funnel-GoHighLevel_~021921820633465567830/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Need to design and addabeautiful pricing page to the existing WordPress site",
    "content": "I have an existing one pager site, built n Elgant Themes, I need to add packages page - 3 packages - that is all, you will have to design it too. It is urgent, so ideally I needagreat designer who has enough tech skills to also add it and make it work. Very urgent. Need it tonight. I have examples of what I like",
    "link": "https://www.upwork.com/jobs/Need-design-and-add-span-class-highlight-span-beautiful-pricing-page-the-existing-WordPress-site_~021921819351098252684/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Graphics designer needed foraFB retargeting campaign",
    "content": "We’re seekingatalented and reliable graphic designer to create high-converting Facebook ad images forachiropractic marketing campaign. The goal is to drive new patient bookings using our proven $89 New Patient Package offer (normally $266 value), focused on regional Australian towns with populations between 12,000 and 60,000.\n\nThis posting includesapaid trial milestone. Multiple designers will be hired for the trial, and the best-performing designer will be selected to complete the full scope of work.\n\n🏁 TRIAL MILESTONE (Paid)\nYou will be asked to design 2 static image ads (1 cold, 1 retargeting) from our detailed brief below.\nWe are testing for:\n\nVisual quality\n\nOn-brief execution\n\nTurnaround time\n\nWillingness to follow guidelines\n\nTrial Brief: https://docs.google.com/document/d/1eE9ct3hkuNRwBjjek25E6QcK5-xNJEtJ6tI6wRHZASw/edit?usp=sharing",
    "link": "https://www.upwork.com/jobs/Graphics-designer-needed-for-span-class-highlight-span-retargeting-campaign_~021921818488204090764/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "CreateaProfessional 2-Page PDF Sales Brochure for Corporate Coaching",
    "content": "I am seekingatalented designer to createavisually appealing 2-page PDF sales brochure for my business asahigh performance and mindset coach. The brochure should highlight the unique benefits of my coaching services and appeal to corporate clients. The ideal candidate will have experience in marketing materials and an understanding of the coaching industry. Please include samples of previous brochure designs in your application.",
    "link": "https://www.upwork.com/jobs/Create-span-class-highlight-span-Professional-Page-PDF-Sales-Brochure-for-Corporate-Coaching_~021921818550476922252/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Go High Level Expert Needed to Build High-Converting landing page toacoach industry! START TODAY!",
    "content": "I’m looking forahighly skilled Go High Level (GHL) expert to buildahigh-converting landing page and sales funnel for my coaching business. This is notabeginner-level project. I need someone who knows how to design, structure, and implementacomplete funnel that drives results — from the first click to purchase my course OR bookacall\n\n🛠️ Key Responsibilities:\n\n🖥️ Buildaprofessionally designed, on-brand landing page in Go High Level\n\n🔁 Set upacomplete funnel flow (Opt-in, Thank You Page, Email/SMS Automation, Booking Page, etc.)\n\n📅 Integrate calendars, forms, automations, and tags as needed\n\n🧠 Connect CRM actions (follow-up sequences, lead tagging, pipeline stages)\n\n📱 Optimize for both desktop and mobile\n\n📊 Ensure everything is tracked correctly (Pixel, UTM, analytics setup)\n\n💡 Provide insights and best practices to improve conversions CRO (copy/layout/flow suggestions areabig plus)\n\n✅ Requirements:\n🧰 Proven experience building funnels in Go High Level (portfolio or examples REQUIRED)\n\n🎯 Strong understanding of funnel strategy for coaches, consultants, or service-based businesses\n\n🎨 Solid design sense — modern, clean, conversion-oriented\n\n🤖 Familiar with lead generation, call booking flows, and automation inside GHL\n\n⚡ Able to work quickly and independently\n\n💬 Excellent communication skills andaproactive mindset\n\n\nBonus if you:\nCan write or improve conversion copy\n\nUnderstand basic ad traffic flows (Facebook/Google Ads)\n\nHave worked with personal brands or coaching offers before\n\nTo Apply:\n\nPlease send:\n\nLinks to 2-3 Go High Level funnels you’ve builtAshort explanation of your funnel strategy approach\n\nYour availability and turnaround time",
    "link": "https://www.upwork.com/jobs/High-Level-Expert-Needed-Build-High-Converting-landing-page-span-class-highlight-span-coach-industry-START-TODAY_~021921814615846764202/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Chinese Social media creator needed forablog post title",
    "content": "We are looking foraMalaysian/Taiwanese/Indonesian  copy writer to be in charge of our content writing for different social media platforms.  (Bilingual in both mandarin and English)\n\n\nThis isapaid trial task foralong-term social media content creator position. It takes 1 hour to finish. \n\nIf you don’t meet the Must-have qualities below,please do not read further. \nWe will select two or three candidates for this task. Whoever’s post gets the most views will be given more tasks  and switch toafull-time role in the future (600-800USD+bonus). \n\nMust-have Qualities: \n1. Malaysian - due to scope of the work, we ONLY consider Malaysians for this positions\n2.Fluent in Simplified Chinese & English:Native speaker level \n3.1 hour  for this task and 6 hours / day for the long-term role \n4.Improver notadoer: Always looking for ways to optimize your work process rather than just following our instructions \n\nWhat you will do for this Trial Task :Write three wechat titles based on an existing youtube video. \nStrictly follow step by step listed in the template below \nhttps://docs.google.com/document/d/1MpWYcp3TvLRohCN3g1pEczW1UfZIfQSsBYjl791w6Yc/edit?usp=sharing\n\nApplication Process: \n - To ensure you read the instructions in the template, please message us the answers for this question:  What’s the name of our 公众号？ \n\nAbout us :  We areaSingapore-based IELTS Test Prep company, expanding to the global market (9 years in the industry). We’re looking forasocial media specialist to systemize our content production and distribution on Chinese platforms including WeChat, Bilibili, and Xiaohongshu (The Red).   We already have established accounts on all these platforms. You will be working with an editor (wechat post and video), andacoach (who is in charge of recording)",
    "link": "https://www.upwork.com/jobs/Chinese-Social-media-creator-needed-for-span-class-highlight-span-blog-post-title_~021921814135518977421/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "ArabicA3 Poster Design for IT Services",
    "content": "We are looking foraskilled graphic designer to create anA3 poster advertisement for our IT services, specifically in Arabic. The poster should be visually appealing and effectively communicate our offerings to our target audience. Candidates must have experience in designing marketing materials and proficiency in Arabic. Please include your portfolio along with your application to showcase your previous work in poster design.",
    "link": "https://www.upwork.com/jobs/Arabic-span-class-highlight-span-Poster-Design-for-Services_~021921813564733210282/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Looking foratalented UGC Creator for 7 Talking Head Videos (German Language)",
    "content": "We are looking foraskilled UGC creator to record 7 talking head videos based on provided scripts. The videos will be in German, and we require subtitles as well. The task is simple, and the videos should be around 1.5 minutes each. You should record the videos using an iPhone or another similar device and add subtitles using an app like Captions. We need clean, professional videos with neutral backgrounds and good lighting.\n\nThe job includes:\n\n7 videos (1.5 minutes each) in German\n\nAdd subtitles to the videos\n\nClean and professional setup with neutral background and good lighting\n\nIf you have any previous experience with video recording and UGC content creation, please share your portfolio with me. I am looking for someone who can work quickly and deliver high-quality content.",
    "link": "https://www.upwork.com/jobs/Looking-for-span-class-highlight-span-talented-UGC-Creator-for-Talking-Head-Videos-German-Language_~021921813475684279556/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Createanew design based on an existing design (with specific changes and instructions provided)",
    "content": "We are looking to use the attached ROCKY logo as the base but change to make it unique to our requirements.  \n\nEssentially the changes would be:\n\n- change the ROCKY  wording to say COCKROT (this should be pretty easy because we already have all the letters int he font exceptaT)\n\n- Use the same general character layout and positioning, but subbing in pictures ofanew guywith example pictures and specific instructions (this will require some drawing/design skills, we'll want the same lifelike look).  Basically: swapping in face, addingablue suit jacket with torn sleeves (examples provided, making the guy holdatrophy (pictures provided), adding in visuals recreating tattoos that would be visible (pictures provided).  \n\nDesign for use onatshirt so may needacouple different final file types.  \n\nIn addition, we may will want to lookacouple of alternative designs involving the letters (but it will be minor after the main design is done....such is possibly addinga5th COCKROT line and adding colors or outlined colors to each of the words).  \n\nThe contract allows revisions and comments until the design is satisfactory.   \n\nThank you.",
    "link": "https://www.upwork.com/jobs/Create-span-class-highlight-span-new-design-based-existing-design-with-specific-changes-and-instructions-provided_~021921812935480963252/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Berlin. Germany Secret shoppers; Mystery Shopper Wanted – Car consultations asamystery shopper",
    "content": "We are looking for reliable Mystery Shoppers across Germany to participate inapaid consultation project at authorized car dealerships. This isaone-time gig with potential for future assignments if successfully completed.\n\nYou will act asapotential buyer interested in an electric vehicle (EV) and:\n1. Call and book an appointment for the consultation if possible (Hyundai oracompetitor brand).\n2. Visit the dealership at the confirmed time.\n3. Receiveafull consultation in the local language (German) and the price offer.\n4. Ask specific questions (provided in advance) and followapredefined scenario.\n5. Collect basic documentation (price offer, brochure, business card if available).\n6.  Submitashort online report and upload the required pictures/screenshots.\n\n📍 Locations (the list is available below):\nWe have dealership visits available nationwide across the country, The map is available here: https://www.google.com/maps/d/u/0/edit?mid=19F1YhNQ2cVk-HSJ5N6yxA3thv8j7N6g&usp=sharing\n\n💶 Payment:\n20 USD per completed visit\nTravel reimbursement available for longer distances (to be discussed individually) in case of the route.\n\n📋 Requirements:\nNative-level or fluent German\nConfident in communication and playingarole (e.g. potential EV buyer)\nAbility to follow instructions carefully and stay discreet\nSmartphone with internet access for booking, photos, and screenshots\n\n📝 Notes:\nYou will receive clear step-by-step instructions later.\nYou must not reveal that you areamystery shopper.\nAll reports and photos must be submitted within 6–8 hours after the visit.\n\nLooking forward to working with you! This isaperfect opportunity if you're detail-oriented, enjoy driving, and want to earnaquick and easy 20 USD per 1 completed check.",
    "link": "https://www.upwork.com/jobs/Berlin-Germany-Secret-shoppers-Mystery-Shopper-Wanted-Car-consultations-span-class-highlight-span-mystery-shopper_~021921809840799769860/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Help loadaIDX plugin and create listing page",
    "content": "Help me load IDX plugin to my website and createalisting page similar to this that pops up with every listing: \n\nhttps://jademillsestates.com/properties/1129-tower-rd-beverly-hills-ca-us-90210-25-486169\n\nExcept no orange buttons, only white background black saol display front",
    "link": "https://www.upwork.com/jobs/Help-load-span-class-highlight-span-IDX-plugin-and-create-listing-page_~021921807762773171596/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Fix audio fora1:07 hour video file",
    "content": "fix audio fora1:07 hour video file. very simple, should take few min of work",
    "link": "https://www.upwork.com/jobs/Fix-audio-for-span-class-highlight-span-hour-video-file_~021921807674280243380/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "NeedaVirtual Assistant/ Cold Caller",
    "content": "Hello,\n\nI need an assistant that can help me with finding certain prospects within the city of Los Angeles according to some guidelines that we have to work with. After you find the prospects you will then call them withavoice message and update me of the development.",
    "link": "https://www.upwork.com/jobs/Need-span-class-highlight-span-Virtual-Assistant-Cold-Caller_~021921806883895564684/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Looking foraskilled developer to help with Framer landing pages for lead gen",
    "content": "Our specialized garage flooring company needs conversion-focused landing pages built in Framer for both our main business and seasonal promotions. Current website performance is bad - slow loading times are causing potential customers to leave before converting, and it’s not responsive. \nWe are looking foraFramer developer who can createafew separate pages that effectively showcase our premium flooring solutions while making it simple for customers to request quotes or consultations.\n\nRequirements:\n\nExperience creating websites for home improvement or specialty contracting businesses\nStrong understanding of local service business lead generation\nTechnical expertise to deliver exceptional page speed performance\nPortfolio demonstrating clean, professional designs that build trust\nAbility to effectively showcase before/after project galleries without compromising speed\nMobile-first responsive approach (critical as most of our traffic is on phones)\nIntegration of user-friendly quote request forms\nPreferable platform - Wordpress or Framer\n\nPlease share examples of service business websites you've built with both conversion and performance metrics.",
    "link": "https://www.upwork.com/jobs/Looking-for-span-class-highlight-span-skilled-developer-help-with-Framer-landing-pages-for-lead-gen_~021921806065095697668/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "I need someone that can provideatiktok agency ad account for us",
    "content": "If you can provideatiktok agency ad account, plz respond by replying to the following email: \nIs thisareal TikTok agency ad account (not self-serve)?\nWill I get access via TikTok Business Center to run ads myself?\nAny VAT fees?\nWhat’s the minimum top-up amount?\nWhat payment methods do you accept?\nIs ad approval faster and safer on your account?\nCan I target Tier 1 countries like the US and UK or is there any country restrictions?",
    "link": "https://www.upwork.com/jobs/need-someone-that-can-provide-span-class-highlight-span-tiktok-agency-account-for_~021921805572256774742/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "BuildaWordPress Website on installed Theme Template",
    "content": "Build WordPress Website on Theme.\nMostly it is to re-arrange and modify different sections of the theme. And to change the content.\n\nI have createdadetailed guide for editing.\n\nWebsite has 10-11 Pages.",
    "link": "https://www.upwork.com/jobs/Build-span-class-highlight-span-WordPress-Website-installed-Theme-Template_~021921803481638977194/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Aperformance marketing agency worthy portfolio Framer website",
    "content": "We areaUK-based marketing agency that needsacomplete website overhaul using Framer. Like most agencies, our current site looks dated and loads slowly, creatingadisconnect between the recommendations and services we offer to our clients. \n\nWe're looking foraskilled Framer developer who can createahigh-converting website that reflects our expertise and builds our brand presence.\n\nCritical priorities:\nProfessional, modern design that showcases our creative capabilities\nSuperior page speed performance (minimum 90+ on PageSpeed Insights)\nStrategic user flows that guide potential clients to contact us\nCase study presentation that highlights our success stories.\n\nRequirements:\nProven experience developing marketing agency websites in Framer\nTechnical expertise to deliver exceptional loading speeds\nStrong portfolio demonstrating both visual excellence and conversion optimization\nAbility to implement comprehensive analytics and user behavior tracking\nExperience with UK market targeting and local SEO considerations\nMobile-first responsive design approach\n\nPlease share examples of agency websites you've developed with both visual impact and performance metrics.",
    "link": "https://www.upwork.com/jobs/span-class-highlight-span-performance-marketing-agency-worthy-portfolio-Framer-website_~021921803282548286724/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Instagram Expert – Wanted foralarge-scale prospecting mission",
    "content": "We are looking for an Instagram expert capable of managingalarge-scale prospecting campaign to recruit models to collaborate with our team.\n\n🎯 Objective:\nContact more than 100,000 targeted profiles (female content creators) on Instagram every day, according toadefined strategy.\n\n💼 Your responsibilities:\n\nIdentify and filter qualified model profiles via Instagram\n\nManage the sending of personalized messages (via DMs) onalarge scale, while respecting the platform's rules\n\nUse appropriate tools to track conversations, replies, and follow-ups\n\nCollaborate with our team to refine the message, target audience, and conversions\n\nOptimize response and conversion rates\n\n✅ Desired profile:\n\nPerfect command of Instagram and its limitations (actions per day, shadow ban, etc.)\n\nKnowledge of tools or methods to strategically manage large volumes of messages\n\nExperience in prospecting or influencer marketing =areal plus\n\nSerious, structured, and results-oriented\n\nIf you have already successfully run this type of large-scale campaign, please specify this in your application.\n\nWe are ready to start immediately.",
    "link": "https://www.upwork.com/jobs/Instagram-Expert-Wanted-for-span-class-highlight-span-large-scale-prospecting-mission_~021921801828341146884/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Web Developer Needed to BuildaSecondary Marketplace Platform",
    "content": ":\nI’m looking foraskilled web developer orasmall development team to buildasecondary marketplace platform where users can buy and sell pre-owned products (like [insert your niche here, e.g., electronics, fashion, or collectibles]).\n\nThis project involves designing and developingaresponsive, secure, and scalable website with modern UI/UX and backend functionality. It will include user accounts, listings,apayment system, and an admin panel.\n\n⸻\n\nCore Features:\n\t•\tUser registration & login (email/social login)\n\t•\tProduct listing (upload images, write descriptions, set price)\n\t•\tSearch and filter functionality\n\t•\tMessaging/chat system (optional for MVP)\n\t•\tRatings and reviews\n\t•\tWishlist or “favorites”\n\t•\tAdmin dashboard (manage users, listings, content)\n\t•\tEmail notifications\n\t•\tPayment gateway integration (Stripe/Razorpay/PayPal)\n\t•\tSEO-friendly URLs\n\n⸻\n\nTech Stack (Suggested but open to recommendations):\n\t•\tFrontend: React.js / Next.js / Vue.js\n\t•\tBackend: Node.js (Express/NestJS) OR Django (Python)\n\t•\tDatabase: PostgreSQL or MongoDB\n\t•\tHosting: Render / DigitalOcean / AWS / Vercel / Netlify\n\t•\tStorage: AWS S3 or equivalent for product images\n\t•\tAuthentication: JWT or OAuth-based login\n\t•\tPayment: Stripe, Razorpay, or PayPal integration\n\n⸻\n\nDeliverables:\n\t•\tFully functional website\n\t•\tAdmin panel\n\t•\tDeployment toalive environment (help with hosting setup)\n\t•\tDocumentation (technical and operational)\n\t•\t(Optional) Ongoing maintenance or support\n\n⸻\n\nBudget: $3,000 – $6,000 (flexible based on expertise and approach)\nTimeline: MVP within 4–6 weeks, full version in 8–12 weeks\nProject Type: One-time project, with potential for long-term collaboration\n\n⸻\n\nYou Should Have:\n\t•\tExperience building marketplaces or e-commerce websites\n\t•\tStrong UI/UX sense and responsive design skills\n\t•\tExperience with secure payment integrations\n\t•\tKnowledge of hosting, deployment, and performance optimization\n\t•\tAbility to suggest the best tech stack based on scale and budget\n\n⸻\n\nTo Apply:\nPlease share:\n\t1.\tRelevant portfolio links (especially marketplace/e-commerce projects)\n\t2.\tYour proposed tech stack\n\t3.\tEstimated timeline and approach for MVP\n\t4.\tAny questions or suggestions you have",
    "link": "https://www.upwork.com/jobs/Web-Developer-Needed-Build-span-class-highlight-span-Secondary-Marketplace-Platform_~021921799839066308266/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Looking foraRadar Engineer",
    "content": "We are looking foraRadar Expert International\nKey Skills:\nRadar System Expertise:\nIn-depth knowledge of Doppler radar, weather radar, and remote sensing technologies.\nProficiency in C-band, S-band, and X-band radar systems.\nExpertise in signal processing, radar calibration, and performance optimization.\nExperience in radar site selection, installation, and commissioning.\nStructural and Electrical Engineering:\nUnderstanding of structural load calculations, concrete pile strength assessment, and building retrofitting.\nAbility to prepare Architectural, Electrical, Plumbing, and HVAC drawings for radar tower modifications.\nFamiliarity with building codes, electrical safety, and structural integrity assessments.\nProject Planning and Documentation:\nExperience in preparing technical specifications, equipment drawings, and training plans.\nSkilled in drafting Feasibility Studies (FS), Development Project Proposals and cost estimates.\nStrong technical writing and documentation skills.\nData Analysis and Signal Processing:\nKnowledge of radar data processing, Doppler velocity analysis, and clutter reduction techniques.\nProficiency in using radar data for wind and rainfall estimation.\nAbility to interpret radar reflectivity and velocity data for accurate weather forecasting.\nCommunication and Team Collaboration:\nStrong interpersonal and communication skills for coordination with multidisciplinary teams.\nAbility to present complex technical concepts to non-technical stakeholders.\nExperience in conducting training sessions for radar operators and technical staff.\nEducation and Certifications:\nBachelor’s or Master’s degree in Electrical Engineering, Electronics, Atmospheric Sciences, Meteorology, orarelated field.\nProfessional certifications in Radar Technology, Remote Sensing, or Meteorological Instrumentation are highly desirable.\nFamiliarity with international meteorological standards (e.g., WMO, ICAO) is an advantage.",
    "link": "https://www.upwork.com/jobs/Looking-for-span-class-highlight-span-Radar-Engineer_~021921795212334097668/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Looking forayoutube editor",
    "content": "1. Looking foraYouTube video editor to edit 2 to 3 videosaweek\n2. Fluent in English.\n3. Well-versed with YouTube.\n4. Understand copy write issues. \n5. •\tunderstanding, YouTube dynamics Knowledge of what keeps viewers engaged (hooks, pacing, retention tactics). My tone for my scenery is (DRAMA EAra  With celebrities)  With celebrities. With Cele. With Cele WithMy tone for my scenery as drama.My tone for my scenery as.My tone for my sceneMy tone for myMy tone.My to.My.My\n6. Ability to match your channel’s tone (e.g., fast-paced, cinematic, comedic, documentary-style). Proficiency in software like Adobe Premiere Pro, Final Cut, or DaVinci Resolve",
    "link": "https://www.upwork.com/jobs/Looking-for-span-class-highlight-span-youtube-editor_~021921794626473714948/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Createadynamic dropdown list based onavalue",
    "content": "Haveaspreadhseet that i want to be able to createadynamic drop down based on values - I can share the doc.\n\nSay if one cell has x, then i want another cell on another tab to only give meadropdown of what x is.\n\nThere needs to beanew column there with the drop down (next to notes section).",
    "link": "https://www.upwork.com/jobs/Create-span-class-highlight-span-dynamic-dropdown-list-based-span-class-highlight-span-value_~021921791514482569396/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "BuildaNotification Crawler",
    "content": "BuildaCrawler that crawls Notifications/Posts from source website.\nThen I will be able to integrate into my Platform in future.\n\nI haveaguide for Crawler. Will send it in Chat.",
    "link": "https://www.upwork.com/jobs/Build-span-class-highlight-span-Notification-Crawler_~021921790631726496342/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Looking foradesigner to makeat shirt design",
    "content": "I needadesign forat shirt where I want holy mary in it but also the text and style as the ''lord forgive me''. I need it to be vintage looking and colors needs to be #584e44",
    "link": "https://www.upwork.com/jobs/Looking-for-span-class-highlight-span-designer-make-span-class-highlight-span-shirt-design_~021921788484871993942/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Searching foraTour Guide to Jakarta",
    "content": "I need to findatour guide for Jakarta, Indonesia. I will arrive in Jakarta on May 13th, 2025 and I need you to be my guide to take me to learn about the large supermarkets and wholesale markets selling shampoo, skincare products, shower gel and other toiletries in the local area. The tour will take halfaday.\nRequirement: \n1. It's best to speak Chinese, it's okay if you can't, but you must be able to speak English.\n2. Be serious, responsible, enthusiastic, and reliable, and be punctual.\n3. You need to plan the route for us to confirm before 4:30 pm Beijing time today.",
    "link": "https://www.upwork.com/jobs/Searching-for-span-class-highlight-span-Tour-Guide-Jakarta_~021921789606545800874/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Logo Designer Wanted: Help ShapeaModern Dental Brand",
    "content": "We're seekingatalented and creative logo designer to refine and elevate the brand identity for our client’s new specialist website: The Auckland Dental Implant Centre.\n\nThe client already hasadraft logo concept they’re fond of, which we’ll share with you. Your role will be to take that foundation and transform it — making the logo cleaner, more modern, more professional, and well-suited for long-term brand use.\n\nImportant context:\nThe Auckland Dental Implant Centre is part ofalarger group, Dental Care West. While the new logo should confidently stand on its own, it must also visually complement the Dental Care West brand — especially since the two logos may appear side by side on signage and marketing materials.\n\nYou’ll receive:\n\nThe current Dental Care West logo (for inspiration and brand alignment)\n\nThe client's draft logo concept (asastarting point)\n\nDeliverables:\n\n2–3 refined logo concepts, with opportunity for feedback and revisions\n\nFinal logo files in vector format (AI, EPS) and high-resolution PNGs\n\nVariants for use on light and dark backgrounds, plus black-and-white versions\n\nWe’re looking for someone withakeen eye for balance, typography, and modern design. If that’s you, we’d love to see your portfolio.",
    "link": "https://www.upwork.com/jobs/Logo-Designer-Wanted-Help-Shape-span-class-highlight-span-Modern-Dental-Brand_~021921790437072856325/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Design & FormataClean, Professional PDF Workbook fora7-Day Nervous System Program",
    "content": "NOTE: if done correctly and to your best of standards there is more protocols i am creating within this niche and would have you format the full protocol\n\n🧠 Project Name:\n\nThe Rewire Protocol\nBuild the Foundation for Lifelong Nervous System Change\n\n📝 Project Overview:\n\nI’m developingadigital product called The Rewire Protocol,ascience-informed, 7-day program designed to help people begin regulating their nervous system and building long-term calm through somatic, breath, and awareness-based practices.\n\nI’m looking foradesigner to turn this content intoaclean, professional PDF experience. Your role is to format and visually design the materials using the provided brand kit and written content.\n\n📌 You do not need to write content—everything will be provided. You’ll focus purely on layout, structure, and visual clarity.\n\nIf this collaboration goes well, there is future work available fora30-day and long-term version of the protocol.\n\n⸻\n\n🎯 Deliverables:\n\t1.\tIntro PDF\n“Understanding Your Nervous System” –Aclean, branded explanation of how nervous system regulation and rewiring work.\n\t2.\tProtocol Overview PageAvisual 1-pager showing how to use the program.\n\t3.\t7 Daily Practice Pages\nEach day includes:\n\t•Ashort teaching (why it matters)\n\t•\tOne nervous system practice (breath, stillness, movement)\n\t•Areflection prompt\n\t4.\tQuick Reference SheetAvisual sheet showing nervous system states (fight/flight/freeze/shutdown) + recommended tools.\n\t5.\tPrintable Tracker (Optional)Aone-page tracker to match an existing Notion-based version (you’ll receive examples).\n\n⸻\n\n🎨 Design Style:\n\t•\tClean, calm, and professional\n\t•\tNeutral tones, generous spacing, clear flow\n\t•\tUse Montserrat font and provided Shift logo\n\t•\tDesigned for nervous system-sensitive users—no busy, corporate, or cartoon visuals\n\n⸻\n\n📂 Assets You’ll Receive:\n\t•\tFinal written content + daily structure\n\t•\tBrand kit (logo, font, tone)\n\t•\tPDF layout examples and references\n\n⸻\n\n🕒 Timeline:\n\t•\tStart: ASAP\n\t•\tFirst draft within 7–10 days preferred\n\t•\t1 round of minor revisions expected\n\n⸻\n\n💬 To Apply:\n\nPlease include:\n\t•\tPortfolio samples (especially wellness, workbook, or professional editorial design)\n\t•\tYour estimated price and turnaround time\n\t•\tAny questions or ideas you’d like to share",
    "link": "https://www.upwork.com/jobs/Design-amp-Format-span-class-highlight-span-Clean-Professional-PDF-Workbook-for-span-class-highlight-span-Day-Nervous-System-Program_~021921786321278024278/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Basic audio processing foratraining video",
    "content": "We havea54 minute video ofaCPR training session conducted by doctors atacommunity hall.  This video needs audio processing with enhancing and noise removal. This is for an NGO to spread awareness for emergency help duringacardiac event.  We will need specific parts of the video for social media distribution.  I have attachedascaled down sample.\n\nTasks:\n==================\n1. Enhance and fix audio. \n2. Break up the video into specific chapters (we will provide timestamps),  and add an intro slide (few seconds) that displays the topic headline.\n3. Possibly, addalogo to the top right corner.\n\nThe final videos must be of professional quality for social media distribution.\n\nIf you need more information, please ask before you name your price.",
    "link": "https://www.upwork.com/jobs/Basic-audio-processing-for-span-class-highlight-span-training-video_~021921787752743462148/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "DesignaPolitical Logo and Branding Package",
    "content": "We are seekingatalented graphic designer to createadistinctive political logo andacomprehensive design package. The logo should encapsulate our campaign's values and appeal to our target audience. In addition to the logo, we requireadesign package that includes social media graphics, flyers, and promotional materials. The ideal candidate will have experience in political branding andastrong portfolio showcasing their previous work. Creativity and an understanding of political themes are essential for this project.",
    "link": "https://www.upwork.com/jobs/Design-span-class-highlight-span-Political-Logo-and-Branding-Package_~021921785256591179434/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Searching foraTour Guide to Jakarta",
    "content": "I need to findatour guide for Jakarta, Indonesia. I will arrive in Jakarta on May 13th, 2025.5 and I need you to be my guide to take me to learn about the large supermarkets and wholesale markets selling shampoo, skincare products, shower gel and other toiletries in the local area. The tour will take halfaday.\nRequirement: \n1. It's best to speak Chinese, it's okay if you can't, but you must be able to speak English.\n2. Be serious, responsible, enthusiastic, and reliable, and be punctual.\n3. You need to plan the route for us to confirm before 4:30 pm Beijing time today.",
    "link": "https://www.upwork.com/jobs/Searching-for-span-class-highlight-span-Tour-Guide-Jakarta_~021921784101639241386/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Looking foraSenior Full Stack Developer (Python / Fast API, TS/React/Svelte)",
    "content": "I am looking foraSenior Full Stack Developer.\n\nYou will need to work inaremote machine.\n\nYour responsibilities\n- good experience with Python and Fast API\n- good experience with TypeScript, React, Node, and Svelte\n- good experience with SQL\n- good experience with Docker and Kubernetes\n- familiar with GitHub\n- full time availability in US time zone (PT) - Very Important\n- good communication skills\n- start working ASAP (Today) - Very Important",
    "link": "https://www.upwork.com/jobs/Looking-for-span-class-highlight-span-Senior-Full-Stack-Developer-Python-Fast-API-React-Svelte_~021921786768034552204/?referrer_url_path=/nx/search/jobs/"
  }
]