[
  {
    "title": "Developer Needed for CS Skins Marketplace with Onchain Support",
    "content": "We are looking for a skilled developer to create a CS skins marketplace starting with the integration of one skin. The project involves onchain handling of skins and requires familiarity with both the Steam API and Solana Metaplex. If you have experience working with digital assets and blockchain technology, we would love to hear from you. Your expertise will help us build a seamless platform for users to buy, sell, and trade skins effectively.",
    "link": "https://www.upwork.com/jobs/Developer-Needed-for-Skins-Marketplace-with-Onchain-Support_~021922271143561523086/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Blockchain Dev",
    "content": "Greetings Upworkers!\n\nDo you speak verbal English?\n\nLive to provide solutions?\n\nTask: Looking DLT dev.\n\n// You should be able to work on remote sessions via AnyDesk if required. \n\n1 # Full support till perfect. \n\n2# Best practices.\n\n3# Happy with deadlines.\n\n4# Confirm the times you are online.\n\n5# If you don't answer the questions raised in the job posting, it is likely you won't get a reply from us.\n\n6# You should be able to create video i.e. via loom to showing your output.\n\n7# You should be able to use AI tools, let me know what you have been working with during your workflows.. \n\n8# Confirm if you are willing to learn new skills. \n\n9# Confirm you can verify your Upwork account if it has not yet been verified The reason I ask is that Upwork may block your account after I issue you acontract. It is essential that you are able to complete the verification process.\n\n10# Payment on completion\nTo fast track your application, pease do send a video recording via a cloud URL, not google drive, you can use loom or dropbox capture.\n\nBudget: Around 5USD + 100 USD + longterm + working with several pre-funded startups\n\nBudget: 100 USD, not hourly\n\nLook forward to working with you on many gigs.\n\nThank you.\n\n✅ Important 👁️\n\nYou might have noticed some a couple of negative feedbacks on my profile and a batch ofcontractswhich I have ended, thesecontractsare dormant, for some odd reason, contractors seem to acceptcontractsthen fall into a blackhole and disappear, I suggest you overlook them and look at the other 800 five star feedback i’v",
    "link": "https://www.upwork.com/jobs/Blockchain-Dev_~021922256389302789510/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Blockchain Developer Crypto coin developer",
    "content": "We are looking for an experienced blockchain andsmartcontractdeveloper to help us build and deploy a highly volatile cryptocurrency. I want to create a highly volatile coin. After every single buy, the price increases, ensuring every user sells at a profit. Suggest which functions I should add to achieve this. Thesmartcontractshould be developed and deployed on either BinanceSmartChain (BSC) or Polygon, depending on which is more suitable for performance and low transaction fees.\nWe will handle the deployment and liquidity addition, but we need your step-by-step support preferably via AnyDesk to ensure everything is executed correctly, including deploying thecontractand adding liquidity on Uniswap. It’s essential that the coin works flawlessly and that the price spikes significantly with each transaction.\nIf you have proven experience creating customsmartcontractsand launching tokens on DEX platforms, we’d love to work with you.",
    "link": "https://www.upwork.com/jobs/Blockchain-Developer-Crypto-coin-developer_~021922255701404105502/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Senior Blockchain Developer",
    "content": "We are looking for an experienced and reliable Blockchain Developer to help us build a robust and scalable NFT marketplace. The ideal candidate will have hands-on experience withsmartcontractdevelopment, NFT standards (ERC-721, ERC-1155), blockchain integration, and security best practices.\n\n\nProject Scope:\n\nOur goal is to create a user-friendly, secure, and scalable NFT platform where users can mint, buy, sell, and trade NFTs. The marketplace will support features like user wallets, royalty enforcement, bidding/auctionfunctionality, metadata management, and more.\n\n\nResponsibilities:\n\n- Design and implementsmartcontracts(ERC-721/ERC-1155)\n- Integratesmartcontractswith a frontend/backend system\n- Develop secure wallet connection (MetaMask, WalletConnect, etc.)\n- Implement minting, listing, buying, andauctionfunctions\n- Ensure scalability and security of blockchain interactions\n- Provide documentation and support forsmartcontractdeployment\n- Collaborate with frontend/backend developers\n\n\nRequirements:\n\n- Proven experience with Ethereum, Solidity, andsmartcontractdevelopment\n- Familiarity with NFT standards (ERC-721, ERC-1155)\n- Experience with Web3.js, Ethers.js, or similar libraries\n- Understanding of blockchain security best practices\n- Experience with IPFS, Pinata, or other decentralized storage solutions\n- Familiarity with NFT metadata standards and media handling\n- Prior experience developing or contributing to an NFT marketplace is a plus\n- Strong problem-solving and communication skills",
    "link": "https://www.upwork.com/jobs/Senior-Blockchain-Developer_~021922233295730896782/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Seeking Experienced Developer to Build Ethereum Sniper Bot for enableTrading() Function",
    "content": "Project Overview:\nI will provide the tokencontractaddress ahead of time.\n\nThe bot must monitor thecontractin real-time and execute a buy transaction the moment trading is enabled (i.e., right after enableTrading() is called).\n\nThe goal is to be among the first buyers once trading is live.\n\n🛠️ Requirements:\nStrong experience with Ethereumsmartcontracts, Web3.js or Ethers.js.\n\nExperience building sniper bots or MEV strategies is highly preferred.\n\nBot should be fast, gas-optimized, and ideally handle nonce management, slippage, and front-running protection.\n\nMust be able to monitor mempool and decodecontracttransactions to detect enableTrading() as it hits the chain.\n\nOptional: Support for proxycontractsor obfuscated launch patterns.\n\n✅ Deliverables:\nFully functional Ethereum sniper bot (preferably in Node.js or Python, but open to suggestions).\n\nInstructions for deploying and running the bot.\n\nSource code with comments and documentation.\n\nTest run on a testnet (or with simulation) to verify functionality.\n\n🔐 Security&Confidentiality:\nYou must follow best practices in coding, avoid exposing private keys, and ensure that the bot runs securely.",
    "link": "https://www.upwork.com/jobs/Seeking-Experienced-Developer-Build-Ethereum-Sniper-Bot-for-enableTrading-Function_~021922232513526755214/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Blockchain Developer Soliditysmartcontract",
    "content": "We are looking for an experienced blockchain andsmartcontractdeveloper to help us build and deploy a highly volatile cryptocurrency. I want to create a highly volatile coin. After every single buy, the price increases, ensuring every user sells at a profit. Suggest which functions I should add to achieve this. Thesmartcontractshould be developed and deployed on either BinanceSmartChain (BSC) or Polygon, depending on which is more suitable for performance and low transaction fees.\nWe will handle the deployment and liquidity addition, but we need your step-by-step support preferably via AnyDesk to ensure everything is executed correctly, including deploying thecontractand adding liquidity on Uniswap. It’s essential that the coin works flawlessly and that the price spikes significantly with each transaction.\nIf you have proven experience creating customsmartcontractsand launching tokens on DEX platforms, we’d love to work with you.",
    "link": "https://www.upwork.com/jobs/Blockchain-Developer-Solidity-span-class-highlight-smart-span-span-class-highlight-contract-span_~021922221953827874182/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Featured job posts",
    "content": "This client paid to post their job and reach freelancers like you.",
    "link": "https://www.upwork.com/jobs/Create-web-application-that-connects-EVM-blockchain_~021922192516383764366/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Blockchain Developer Needed for Innovative Project",
    "content": "We are looking for a talented blockchain developer to join our team to work on an exciting new project. The ideal candidate should have experience in developing decentralized applications andsmartcontracts. You will be responsible for designing, implementing, and managing blockchain technology as well as contributing to the overall architecture and infrastructure of our project. If you have a passion for blockchain technology and a desire to work in a collaborative environment, we would love to hear from you!",
    "link": "https://www.upwork.com/jobs/Blockchain-Developer-Needed-for-Innovative-Project_~021922126821281798224/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Blockchain Developer for Innovative Online Shop Project",
    "content": "About Us:\nCryptoCommerce Co. is an exciting startup focused on developing cutting-edge online shop solutions. As we transition into the blockchain space, we are eager to integrate cryptocurrency into our platform to enhance our earning model and provide a seamless shopping experience.\n\nPosition Overview:\nWe are seeking a talented Blockchain Developer to join our dedicated development team. This role is crucial as we aim to build a robust online shop that leverages blockchain technology. The ideal candidate will have a strong background in blockchain development and a passion for creating innovative solutions.\n\nKey Responsibilities:\nDesign and implement blockchain-based solutions for our online shop.\nCollaborate with our web development team to integrate cryptocurrency functionalities.\nEnsure the security and scalability of blockchain applications.\nStay updated with the latest trends and advancements in blockchain technology.\n\nQualifications:\nProven experience in blockchain development (Ethereum, Hyperledger, etc.).\nStrong programming skills in languages such as Solidity, JavaScript, or Python.\nFamiliarity withsmartcontractsand decentralized applications (dApps).\nExcellent problem-solving skills and attention to detail.\nAbility to work independently and as part of a team.\n\nWhy Join Us?\nBe part of an innovative project at the forefront of the blockchain revolution.\nWork in a dynamic and collaborative environment.\nOpportunity for growth and development within the company.\n\nHow to Apply:\nIf you are interested in this exciting opportunity, please fill out the application form linked below:\nhttps://form.jotform.com/250075465405050\n\nWe look forward to reviewing your application and potentially welcoming you to our team!",
    "link": "https://www.upwork.com/jobs/Blockchain-Developer-for-Innovative-Online-Shop-Project_~021922091761249283982/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Develop a Legal Data Analysis Tool for Online Tai Xiu Game on Sunwin",
    "content": "Hi, I’m looking for a skilled developer to create a legal and ethical data analysis tool for the Tai Xiu (Over/Under) game on the Sunwin website. The tool should help analyze game data, such as historical results, trends, and statistics, to assist in making informed decisions during gameplay.",
    "link": "https://www.upwork.com/jobs/Develop-Legal-Data-Analysis-Tool-for-Online-Tai-Xiu-Game-Sunwin_~021922047098272753030/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "SmartContractDeveloper Needed for Account Abstraction Implementation",
    "content": "We are seeking an experiencedsmartcontractdeveloper to implement account abstraction using passkeys without relying on third-party libraries. The ideal candidate should have a strong grasp of blockchain technology andsmartcontractdevelopment. You will be responsible for writing secure, efficient, and optimized code that meets our project's needs. If you have a knack for innovative solutions and a comprehensive understanding of account abstraction, we want to hear from you!",
    "link": "https://www.upwork.com/jobs/span-class-highlight-Smart-span-span-class-highlight-Contract-span-Developer-Needed-for-Account-Abstraction-Implementation_~021921895519506678812/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Experienced Web3 Developer specializing inSmartContract",
    "content": "Hello,\n\nNice to meet you.\n\nBlaize is embarking on an exciting journey to build a Web3 aggregation platform designed to bring value to cryptocurrency enthusiasts worldwide. I'm currently assisting one of my trusted partners at Blaize in assembling a strong, dynamic team for this initiative, and I’d like to invite you to join the project.\n\n🔹 Project Budget:\nThe initial budget for this project is approximately $1.2 million, with more details to be shared in upcoming communications.\n\n🔹 Open Positions:\n- Web3 developer\n-Smartcontractdeveloper\n- Project Manager\n\n🔹 Tech Stack:\nJavaScript, TypeScript, React, Node.js, Next.js, Web3.js, Solidity, Rust, MongoDB, etc\n\n🔹ContractType:\n- Fully remote\n- Full-time or Part-time (minimum 10+ hrs/week)\nIf your initial contribution goes well, you may be invited to join the Onboarding team.\n\nFinal offers are based on experience and location, and include a significant total rewards package.\n\nAs an engineer at Blaize, you’ll tackle a wide range of exciting challenges—from launching new products to engaging directly with leading crypto projects. The work is ambitious and impactful, and we think that’s what makes it fun.\n\nIf you’re a driven professional with exceptional engineering talent, please apply!\n\nThank you!\n\nBest regards,\nAaron",
    "link": "https://www.upwork.com/jobs/Experienced-Web3-Developer-specializing-span-class-highlight-Smart-span-span-class-highlight-Contract-span_~021921892673140244138/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Seeking Web3 dev for fintech-stylesmartcontractextensions",
    "content": "We’re looking for a web3 dev with strong Web3/fintech experience to explore feature development and platform evolution for Midcontract.com.\n\nMidcontract is a live platform that enables:\nLegally sound, flexiblesmartcontractsCrypto and fiat escrow-based payments\nInstant payouts and dispute protection\nB2B-ready flows for service providers and agencies\n\nWe’re actively exploring:\nAPI extensions and automation\nFinance tooling or dashboards for remote teams\nEmbedding Midcontract in existing B2B tools\nUse cases across global freelancers and digital service marketplaces\n\nWe’d love to talk if you:\nBuild or consult on crypto-enabled B2B SaaS\nHave ideas for compliant, trust-based Web3 payments\nLike working with real products, not just POCs",
    "link": "https://www.upwork.com/jobs/Seeking-Web3-dev-for-fintech-style-span-class-highlight-smart-span-span-class-highlight-contract-span-extensions_~021921857970933097732/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Blockchain developer, Soliditysmartcontract",
    "content": "We are looking for an experienced blockchain andsmartcontractdeveloper to help us build and deploy a highly volatile cryptocurrency. The goal is to create a coin where the price increases sharply on every buy and sell transaction, allowing for strong profit potential.\nWe’re open to your expert suggestions on what mechanism would be best for achieving high volatility. Whether it’s a burning system, buyback method, bonding curve, or another approach, we want your guidance on implementing the most effective strategy to boost the coin’s price and drive market activity.\nThesmartcontractshould be developed and deployed on either BinanceSmartChain (BSC) or Polygon, depending on which is more suitable for performance and low transaction fees.\nWe will handle the deployment and liquidity addition, but we need your step-by-step support—preferably via AnyDesk—to ensure everything is executed correctly, including deploying thecontractand adding liquidity on Uniswap. It’s essential that the coin works flawlessly and that the price spikes significantly with each transaction.\nIf you have proven experience creating customsmartcontractsand launching tokens on DEX platforms, we’d love to work with you.",
    "link": "https://www.upwork.com/jobs/Blockchain-developer-Solidity-span-class-highlight-smart-span-span-class-highlight-contract-span_~021921810867603560844/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Experienced Solidity Developer for BSC LotterySmartContract",
    "content": "We are looking for a skilled Solidity developer to design, develop, and deploy a secure and audited LotterySmartContracton BinanceSmartChain (BSC). Thecontractshould include features like:  \n\nKey Requirements:\n✅ Fully decentralized lottery system (Chainlink VRF or other secure RNG for fairness).  \n✅ Multi-tier ticket purchases (users can buy multiple tickets in one transaction).  \n✅ Automated prize distribution (percentage-based to winners, treasury, and burn).  \n✅ BNB/USDT payment support (or other BEP-20 tokens).  \n✅ Admin controls (start/end lottery, emergency withdrawal, fee adjustments).  \n✅ Frontend integration (basic UI connection via Web3.js/ethers.js).  \n\nNice-to-Have Features:\n🔹 Staking rewards for long-term participants.  \n🔹 Referral system (bonus tickets for referrals).  \n🔹 Gas optimization for low-cost transactions.  \n🔹 Audit readiness (code should be clean and well-documented).  \n\n\nBudget&Timeline:\n💵 Budget: $300(fixed price or hourly, based on experience).  \n⏳ Timeline: Expected completion within 2–4 days.  \n\nWould you like any modifications (e.g., adding KYC requirements, multi-chain support, etc.)?",
    "link": "https://www.upwork.com/jobs/Experienced-Solidity-Developer-for-BSC-Lottery-span-class-highlight-Smart-span-span-class-highlight-Contract-span_~021921579675542876340/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Developer Needed for Simple Voting Ticket System on Sui Blockchain",
    "content": "I’m looking for a blockchain developer to help build a small voting ticket system using the Sui network. The idea is to create a basicsmartcontractthat allows users to receive or buy voting tickets, and then use those tickets to vote on different options. Each ticket should count as one vote, and the system should prevent double voting.\n\nThis will be a lightweight implementation focused on core functionality, not a full application. The main goal is to get a workingsmartcontracton the Sui testnet (or mainnet, if ready), with clear and simple logic.\n\nThe system does not need a complex UI—just the backend logic is enough for now. If you have experience with Sui and Move, and you're comfortable building small, efficientcontracts, this should be a quick and straightforward job.\n\nPlease reach out with a short summary of your experience and a rough estimate of your time and cost. This is a low-budget task, so I'm looking for something simple and functional rather than advanced features.",
    "link": "https://www.upwork.com/jobs/Developer-Needed-for-Simple-Voting-Ticket-System-Sui-Blockchain_~021921578927654125226/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Developer of Decentralized Exchange with Blockchain Development Team",
    "content": "We are seeking a developer to join our team in building a high-performance decentralized exchange supporting cross-chain swaps and hybrid liquidity mechanisms (AMM + order book).\n\nRequirements!\n\nProfessional expertise in Solidity or Rust forsmartcontractdevelopment\n\nHands-on experience building DEX/DeFi protocols (similar to Uniswap, Curve)\n\nDeep understanding of AMM mechanics, liquidity pools, and aggregators\n\nExperience integrating oracles (Chainlink, Pyth) and cross-chain bridges\n\nProficiency in Web3.js/ethers.js and blockchain node interaction\n\nResponsibilities:\n\nDevelop and optimize exchangesmartcontracts(gas efficiency, security)\n\nImplement cross-chain functionality and bridge integrations\n\nDesign and configure liquidity pools with various algorithms\n\nEnable frontend-blockchain interaction via The Graph\n\nConduct testing and code audits (Hardhat, Foundry)\n\nPreferred Qualifications:\n\nExperience with zk-rollups or other L2 solutions\n\nContributions to open-source DeFi protocols\n\nUnderstanding of tokenomics and liquidity incentive mechanisms\n\nConditions!\n\nRemote work with flexible hours\n\nLong-term collaboration\n\nCompetitive compensation (negotiable)\n\nCandidates should provide examples of previous DeFi-related work.",
    "link": "https://www.upwork.com/jobs/Developer-Decentralized-Exchange-with-Blockchain-Development-Team_~021921477652313318628/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Experienced Blockchain Developer forSmartContractReview and Staking Vault Design",
    "content": "We are seeking an experienced blockchain developer to review our existingsmartcontractsand assist in designing staking vaults for our blockchain project. The ideal candidate should possess a strong understanding of blockchain technology, and experience with bothsmartcontractand fullstack development as well as auditing. Your expertise will play a crucial role in ensuring the security and efficiency of our staking mechanisms. If you have a proven track record in this field, we invite you to apply and help us elevate our project to the next level.",
    "link": "https://www.upwork.com/jobs/Experienced-Blockchain-Developer-for-span-class-highlight-Smart-span-span-class-highlight-Contract-span-Review-and-Staking-Vault-Design_~021921404778738902276/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Fintech dApp Development for Bank/Stablecoin Integration",
    "content": "**Job Opening: Fintech dApp Developer**\n\nWe are looking for a talented developer to join our team in building an innovative decentralized application (dApp) tailored for the fintech sector. This application will enable users to link their bank accounts and stablecoin wallets, like FVBank, to Uniswap liquidity pools, ensuring smooth transactions and enhanced liquidity for different cryptocurrencies.\n\nThe ideal candidate will possess a strong background in blockchain technology,smartcontractdevelopment, and user interface/user experience (UI/UX) design. This project represents a unique chance to engage with cutting-edge developments in decentralized finance and contribute to groundbreaking financial solutions. If you're passionate about fintech and blockchain innovation, we want to hear from you!",
    "link": "https://www.upwork.com/jobs/Fintech-dApp-Development-for-Bank-Stablecoin-Integration_~021921374103902397668/?referrer_url_path=/nx/search/jobs/"
  },
  {
    "title": "Blockchain Developer Needed for P2E Game Token on BNB",
    "content": "We are seeking an experienced blockchain developer to assist in creating a token on the BinanceSmartChain (BNB) for our Play-to-Earn (P2E) game. The ideal candidate will have a strong understanding of tokenomics andsmartcontractdevelopment. Your expertise will play a crucial role in ensuring the token is secure, efficient, and integrated seamlessly into our gaming ecosystem. If you have a proven track record in blockchain projects and are passionate about gaming, we want to hear from you!",
    "link": "https://www.upwork.com/jobs/Blockchain-Developer-Needed-for-P2E-Game-Token-BNB_~021921220161402257066/?referrer_url_path=/nx/search/jobs/"
  }
]